import pytest

from src.masks import det_masks_card_number, get_masks_account


def test_det_masks_card_number(my_card: str) -> None:
    assert det_masks_card_number("1234567891234567") == my_card


def test_not_det_masks_card_number(my_card_not: str) -> None:
    assert det_masks_card_number("123456789127") == my_card_not


@pytest.mark.parametrize(
    "x, y",
    [
        ("5775683022041250", "5775 68XX XXXX 1250"),
        ("8771777991441480", "8771 77XX XXXX 1480"),
        ("3613973541636720", "3613 97XX XXXX 6720"),
        ("5286499861584240", "5286 49XX XXXX 4240"),
        ("59861584240", "неверно указан номер"),
        ("1111111111111111", "1111 11XX XXXX 1111"),
        ("2222222222222222", "2222 22XX XXXX 2222"),
        ("3333333333333333", "3333 33XX XXXX 3333"),
        ("4444444444444444", "4444 44XX XXXX 4444"),
        ("5555555555550000", "5555 55XX XXXX 0000"),
        ("6666666666666660", "6666 66XX XXXX 6660"),
        ("6666666666666660", "6666 66XX XXXX 6660"),
        ("7777777777777777", "7777 77XX XXXX 7777"),
        ("8888888888888888", "8888 88XX XXXX 8888"),
        ("9999999999999999", "9999 99XX XXXX 9999"),
        ("0000000000000000", "0000 00XX XXXX 0000"),
        ("3613973541636720", "3613 97XX XXXX 6720"),
        ("5286499861584240", "5286 49XX XXXX 4240"),
        ("59861584240", "неверно указан номер"),
        ("9999999999999999", "9999 99XX XXXX 9999"),
        ("0000000000000000", "0000 00XX XXXX 0000"),
        ("5-5", "неверно указан номер"),
        ("5286499861584240", "5286 49XX XXXX 4240"),
        ("59861584240", "неверно указан номер"),
        ("7777777777777777", "7777 77XX XXXX 7777"),
        ("8888888888888888", "8888 88XX XXXX 8888"),
        ("9999999999999999", "9999 99XX XXXX 9999"),
        ("0000000000000000", "0000 00XX XXXX 0000"),
        ("3613973541636720", "3613 97XX XXXX 6720"),
        ("5286499861584240", "5286 49XX XXXX 4240"),
        ("59861584240", "неверно указан номер"),
        ("9999999999999999", "9999 99XX XXXX 9999"),
        ("0000000000000000", "0000 00XX XXXX 0000"),
        ("5-5", "неверно указан номер"),
        ("5286499861584240", "5286 49XX XXXX 4240"),
        ("59861584240", "неверно указан номер"),
        ("", "неверно указан номер"),
        (" dfdf", "неверно указан номер"),
        ("8218216540", "неверно указан номер"),
        ("8218216540CCCCCC", "неверно указан номер"),
    ],
)
def test_det_masks_card_number1(x: str, y: str) -> None:
    assert det_masks_card_number(x) == y


@pytest.mark.parametrize(
    "x, y",
    [
        ("57756830220412508888", "XX8888"),
        ("87717779911111441480", "XX1480"),
        ("36139735422221636720", "XX6720"),
        ("36139735422221636720", "XX6720"),
        ("52864998633331584240", "XX4240"),
        ("99999999999999999999", "XX9999"),
        ("00001111222233334444", "XX4444"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("52864998633331584240", "XX4240"),
        ("99999999999999999999", "XX9999"),
        ("00001111222233334444", "XX4444"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("99999999999999999999", "XX9999"),
        ("9", "неверно указан номер"),
        ("fff9", "неверно указан номер"),
        ("fff9", "неверно указан номер"),
        ("9bbb", "неверно указан номер"),
        ("9vbvb", "неверно указан номер"),
        ("90v2b45", "неверно указан номер"),
        ("902vb4", "неверно указан номер"),
        ("ddddd", "неверно указан номер"),
        ("", "неверно указан номер"),
        ("8218216540", "неверно указан номер"),
        ("82182165555540CCCCCC", "неверно указан номер"),
    ],
)
def test_det_masks_account_number1(x: str, y: str) -> None:
    assert get_masks_account(x) == y


def test_get_masks_account(my_account: str) -> None:
    assert get_masks_account("12345678912345678912") == my_account


def test_get_masks_account_not(my_account_not: str) -> None:
    assert get_masks_account("12345678912sdsdsds12") == my_account_not
